step-by-step/030-populate-database/020-soap/1400-устройства-в-библиотеке/0300.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Библиотека -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceUpdate xmlns:common="http://common.bitel.ru"
                          xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                          xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" deviceGroupIds="1" deviceTypeId="2" entityId="0" entitySpecId="0" id="-1" ident="192.168.1.139"
                  orderManagerDisabled="false" parentId="0" xsi:type="ns5:invDevice">
                <comment></comment>
                <config></config>
                <host>192.168.1.139</host>
                <password>admin</password>
                <secret>secret</secret>
                <username>admin</username>
            </arg0>
        </ns5:deviceUpdate>
    </S:Body>
</S:Envelope>
